In [1]:
import pandas as pd

In [3]:
df = pd.read_excel('partner_data.xlsx', sheet_name='partner_data1', header=0)
df

,id,age,job,marital,education,balance,housing,loan,default
0,1,26.0,unemployed,married,tertiary,454,yes,yes,no
1,2,25.0,technician,married,secondary,517,no,no,no
2,3,36.0,technician,single,secondary,1044,yes,no,no
3,4,45.0,blue-collar,married,secondary,146,yes,yes,no
4,5,27.0,management,married,tertiary,145,no,no,no
...,...,...,...,...,...,...,...,...,...
995,996,41.0,entrepreneur,married,secondary,-1882,yes,no,no
996,997,58.0,management,married,tertiary,1271,yes,no,no
997,998,31.0,services,single,secondary,297,no,no,no
998,999,31.0,entrepreneur,NaN,tertiary,312,no,no,no
999,1000,23.0,blue-collar,single,secondary,780,yes,no,no

In [5]:
df.head(20)

    id   age          job   marital  education  balance housing loan default
0    1  26.0   unemployed   married   tertiary      454     yes  yes      no
1    2  25.0   technician   married  secondary      517      no   no      no
2    3  36.0   technician    single  secondary     1044     yes   no      no
3    4  45.0  blue-collar   married  secondary      146     yes  yes      no
4    5  27.0   management   married   tertiary      145      no   no      no
5    6  45.0   unemployed  divorced    primary       11      no   no     yes
6    7  35.0   management   married   tertiary      298     yes   no      no
7    8  27.0   technician    single  secondary      905     yes  yes      no
8    9   NaN   management   married   tertiary     -485     yes   no     yes
9   10  32.0   unemployed   married  secondary       10     yes   no      no
10  11  46.0  blue-collar   married  secondary       78     yes  yes      no
11  12  53.0   management   married   tertiary        0      no   no      no
12  13  32.0   management    single   tertiary      223      no   no      no
13  14  34.0      student       NaN   tertiary      387     yes   no      no
14  15  58.0   management   married   tertiary       96      no   no      no
15  16  77.0      retired   married   tertiary        0      no   no      no
16  17  31.0  blue-collar    single  secondary     -161      no   no      no
17  18  47.0  blue-collar       NaN  secondary     3630     yes   no      no
18  19   NaN  blue-collar   married  secondary      302      no  yes      no
19  20  47.0  blue-collar   married    primary     1452     yes  yes      no

In [6]:
df.tail(3)

       id   age           job marital  education  balance housing loan default
997   998  31.0      services  single  secondary      297      no   no      no
998   999  31.0  entrepreneur     NaN   tertiary      312      no   no      no
999  1000  23.0   blue-collar  single  secondary      780     yes   no      no

In [7]:
cs = pd.read_csv('partner_data.csv')
cs

,id,age,job,marital,education,balance,housing,loan,default
0,1,26.0,unemployed,married,tertiary,454,yes,yes,no
1,2,25.0,technician,married,secondary,517,no,no,no
2,3,36.0,technician,single,secondary,1044,yes,no,no
3,4,45.0,blue-collar,married,secondary,146,yes,yes,no
4,5,27.0,management,married,tertiary,145,no,no,no
...,...,...,...,...,...,...,...,...,...
995,996,41.0,entrepreneur,married,secondary,-1882,yes,no,no
996,997,58.0,management,married,tertiary,1271,yes,no,no
997,998,31.0,services,single,secondary,297,no,no,no
998,999,31.0,entrepreneur,NaN,tertiary,312,no,no,no
999,1000,23.0,blue-collar,single,secondary,780,yes,no,no